site.org
#+title: Random bits and pieces
#+subtitle: ...about programming, languages, tools, FLOSS software...
#+author: Igor Dejanović
#+hugo_base_dir: .
#+hugo_section: /
#+options: creator:t author:nil

** Sway config :linux:config:wayland:
:PROPERTIES:
:header-args: :mkdirp yes
:header-args:conf: :tangle "~/.config/sway/config"
:EXPORT_FILE_NAME: sway-config
:END:
Migrating to sway/wayland from i3wm/X. This bellow is my sway config. It can be
[[https://orgmode.org/manual/Extracting-Source-Code.html][tangled]] with [[https://orgmode.org/][Org Mode]] to appropriate locations. See [[https://github.com/igordejanovic/igordejanovic.github.io/blob/main/site.org][the source of this site]].

See https://wiki.archlinux.org/title/Sway

Put a warning at the beginning of the tangled file just to be sure not to forget.
#+begin_src conf
#Warning: this config is maintained through Org Mode file. Do not edit directly!
#+end_src

*** Install
#+begin_src sh
sudo pacman -S wayland xorg-xwayland sway swaylock swaybg
#+end_src

See other sections for the installation of other tools used in this config.

The standard location of sway config is =~/.config/sway/config=.

*** Some variables used in the config
#+begin_src conf
set {
#+end_src

~Mod4~ is the ~Win~ key on most keyboards. Since it is unused for other purposes it
is ideal to be a sway modifier key.
#+begin_src conf
    $mod Mod4
#+end_src

Sway config root.
#+begin_src conf
    $sway ~/.config/sway
#+end_src

A script to handle lock/suspend.
#+begin_src conf
    $exit $sway/exit.sh

#+end_src

A script for managing multiple displays. See [[#display-profile][bellow]].
#+begin_src conf
    $display_profile $sway/display-profile.sh
#+end_src

Socket used for [[https://github.com/francma/wob][wob]], a tool for creating overlay bar during setting of volume,
screen brightness etc. Create it with ~mkfifo~. See the README of the project. See
[[#media-buttons][bellow for the usage]].
#+begin_src conf
    $SWAYSOCK.wob ~/.local/share/sway-wob.sock
#+end_src

#+begin_src conf
}
#+end_src
*** Windows setup
Use minimal borders.
#+begin_src conf
default_border pixel 2
#+end_src

Use Mouse+$mod to drag floating windows to their wanted position.
#+begin_src conf
floating_modifier $mod
#+end_src

Background color.
#+begin_src conf
output "*" bg "#002244" solid_color
#+end_src

Font for window titles and swaybar.
#+begin_src conf
font pango:Hack 10
#+end_src

*** Basic keybindings

Start alacritty terminal:
#+begin_src conf
bindsym $mod+Return exec alacritty
#+end_src

Screenshot can be taken with [[https://github.com/emersion/grim][grim]] which uses [[https://github.com/emersion/slurp][slurp]] to select a region and then
open the captured image in [[https://wiki.gnome.org/Apps/gthumb][gthumb]]:
#+begin_src conf
bindsym Print exec grim -g "$(slurp)" ~/screenshot.png && gthumb ~/screenshot.png
#+end_src

Kill focused window:
#+begin_src conf
bindsym $mod+Shift+q kill
#+end_src

Switch back and forth between workspaces:
#+begin_src conf
workspace back_and_forth yes
bindsym $mod+tab workspace back_and_forth
#+end_src

Change focus (use vim bindings).
#+begin_src conf
bindsym $mod+h focus left
bindsym $mod+j focus down
bindsym $mod+k focus up
bindsym $mod+l focus right
#+end_src

Move focused window (vim bindings):
#+begin_src conf
bindsym $mod+Shift+h move left
bindsym $mod+Shift+j move down
bindsym $mod+Shift+k move up
bindsym $mod+Shift+l move right
#+end_src

Split in horizontal and vertical orientations. When pressing a hint is displayed
on the window where the next application will be positioned.
#+begin_src conf
bindsym $mod+b split h
bindsym $mod+v split v
#+end_src

Toggle fullscreen mode for focused window:
#+begin_src conf
bindsym $mod+f fullscreen toggle
#+end_src

Change container layout (stacked, tabbed, toggle split):
#+begin_src conf
bindsym $mod+s layout stacking
bindsym $mod+w layout tabbed
bindsym $mod+e layout toggle split
#+end_src

Toggle tiling/floating:
#+begin_src conf
bindsym $mod+Shift+space floating toggle
#+end_src

Change fofuc between tiling/floating windows
#+begin_src conf
bindsym $mod+space focus mode_toggle
#+end_src

Focus the parent/child container:
#+begin_src conf
bindsym $mod+a focus parent
bindsym $mod+Shift+a focus child
#+end_src

Reload configuration file:
#+begin_src conf
bindsym $mod+Shift+r reload
#+end_src

Exit sway. Log out of wayland session:
#+begin_src conf
bindsym $mod+Shift+e exec "swaynag -t warning -m 'You pressed the exit shortcut. Do you really want to exit sway? This will end your wayland session.' -B 'Yes, exit sway' 'swaymsg exit'"
#+end_src

*** Workspaces and window associations
Define names for default workspaces for which we configure key bindings later on. We use variables to avoid repeating the names in multiple places.
#+begin_src conf
set $ws1 "1:editor"
set $ws2 "2:browser"
set $ws3 "3:message"
set $ws4 "4:files"
Set $ws5 "5:"
set $ws6 "6"
set $ws7 "7"
set $ws8 "8"
set $ws9 "9"
set $ws10 "10:music"
#+end_src

Switch to workspace:
#+begin_src conf
bindsym $mod+1 workspace $ws1
bindsym $mod+2 workspace $ws2
bindsym $mod+3 workspace $ws3
bindsym $mod+4 workspace $ws4
bindsym $mod+5 workspace $ws5
bindsym $mod+6 workspace $ws6
bindsym $mod+7 workspace $ws7
bindsym $mod+8 workspace $ws8
bindsym $mod+9 workspace $ws9
bindsym $mod+0 workspace $ws10
#+end_src

Move workspace to left/right output:
#+begin_src conf
bindsym $mod+Shift+Alt+h move workspace to output left
bindsym $mod+Shift+Alt+l move workspace to output right
#+end_src

You can map workspace to output using this. Can be handy in multi-display
setups.
#+begin_src conf :tangle no
workspace "1:editor" output DP1 eDP1
workspace "2:browser" output DP1 eDP1
#+end_src

Assign application window classes to workspaces:
#+begin_src conf
assign [class="Viber"] "3:message"
assign [class="Skype"] "3:message"
assign [class="Audacious"] "10:music"
#+end_src

/TODO: Write how to get the name of the application class./

Send curent workspace to other output:
#+begin_src conf
bindsym $mod+o exec swaymsg -t get_outputs | \
        jq '.[] | select(.focused!=true) | .name' | head -n1 | xargs swaymsg move workspace to
#+end_src

[[https://github.com/swaywm/sway/issues/4346][Source]]

Move focused container to workspace:
#+begin_src
bindsym $mod+Shift+1 move container to workspace $ws1
bindsym $mod+Shift+2 move container to workspace $ws2
bindsym $mod+Shift+3 move container to workspace $ws3
bindsym $mod+Shift+4 move container to workspace $ws4
bindsym $mod+Shift+5 move container to workspace $ws5
bindsym $mod+Shift+6 move container to workspace $ws6
bindsym $mod+Shift+7 move container to workspace $ws7
bindsym $mod+Shift+8 move container to workspace $ws8
bindsym $mod+Shift+9 move container to workspace $ws9
bindsym $mod+Shift+0 move container to workspace $ws10
#+end_src
*** Media buttons with bar overlay
:PROPERTIES:
:CUSTOM_ID: media-buttons
:END:
Install [[https://github.com/francma/wob][wob]]:
#+begin_src sh
sudo pacman -S wob
#+end_src

Setup named pipe/socket (do this once):
#+begin_src sh
mkfifo ~/.local/share/sway-wob.sock
#+end_src

Connect socket to wob in the config:
#+begin_src conf
exec tail -f $SWAYSOCK.wob | wob
#+end_src
**** Screen brightness
Install [[https://github.com/haikarainen/light][light]]:
#+begin_src sh
sudo pacman -S light
#+end_src

Call light on brightness keys and pipe to wob:
#+begin_src conf
bindsym XF86MonBrightnessUp exec light -A 10 && light -G | cut -d'.' -f1 > $SWAYSOCK.wob
bindsym XF86MonBrightnessDown exec light -U 10 && light -G | cut -d'.' -f1 > $SWAYSOCK.wob
#+end_src

**** Media player controls
Install [[https://github.com/altdesktop/playerctl][playerctl]]:
#+begin_src sh
sudo pacman -S playerctl
#+end_src

Call playerctl on media keys:
#+begin_src conf
bindsym XF86AudioPlay exec playerctl play-pause
bindsym XF86AudioStop exec playerctl stop
bindsym XF86AudioNext exec playerctl next
bindsym XF86AudioPrev exec playerctl previous
#+end_src

