content/recipes/sway-config.md
+++
title = "Sway config"
lastmod = 2023-01-17T11:47:11+01:00
rtags = ["linux", "config", "wayland"]
draft = false
creator = "Emacs 28.2 (Org mode 9.6 + ox-hugo)"
+++

Migrating to sway/wayland from i3wm/X. This bellow is my sway config. It can be
[tangled](https://orgmode.org/manual/Extracting-Source-Code.html) with [Org Mode](https://orgmode.org/) to appropriate locations. See [the source of this site](https://github.com/igordejanovic/igordejanovic.github.io/blob/main/site.org).

See <https://wiki.archlinux.org/title/Sway>

Put a warning at the beginning of the tangled file just to be sure not to forget.

```cfg
#Warning: this config is maintained through Org Mode file. Do not edit directly!
```


## Install {#install}

```sh
sudo pacman -S wayland xorg-xwayland sway swaylock swaybg
```

See other sections for the installation of other tools used in this config.

The standard location of sway config is `~/.config/sway/config`.


## Some variables used in the config {#some-variables-used-in-the-config}

```cfg
set {
```

`Mod4` is the `Win` key on most keyboards. Since it is unused for other purposes it
is ideal to be a sway modifier key.

```cfg
    $mod Mod4
```

Sway config root.

```cfg
    $sway ~/.config/sway
```

A script to handle lock/suspend.

```cfg
    $exit $sway/exit.sh
```

A script for managing multiple displays. See [bellow](#display-profile).

```cfg
    $display_profile $sway/display-profile.sh
```

Socket used for [wob](https://github.com/francma/wob), a tool for creating overlay bar during setting of volume,
screen brightness etc. Create it with `mkfifo`. See the README of the project. See
[bellow for the usage](#media-buttons).

```cfg
    $SWAYSOCK.wob ~/.local/share/sway-wob.sock
```

```cfg
}
```


## Windows setup {#windows-setup}

Use minimal borders.

```cfg
default_border pixel 2
```

Use Mouse+$mod to drag floating windows to their wanted position.

```cfg
floating_modifier $mod
```

Background color.

```cfg
output "*" bg "#002244" solid_color
```

Font for window titles and swaybar.

```cfg
font pango:Hack 10
```


## Basic keybindings {#basic-keybindings}

Start alacritty terminal:

```cfg
bindsym $mod+Return exec alacritty
```

Screenshot can be taken with [grim](https://github.com/emersion/grim) which uses [slurp](https://github.com/emersion/slurp) to select a region and then
open the captured image in [gthumb](https://wiki.gnome.org/Apps/gthumb):

```cfg
bindsym Print exec grim -g "$(slurp)" ~/screenshot.png && gthumb ~/screenshot.png
```

Kill focused window:

```cfg
bindsym $mod+Shift+q kill
```

Switch back and forth between workspaces:

```cfg
workspace back_and_forth yes
bindsym $mod+tab workspace back_and_forth
```

Change focus (use vim bindings).

```cfg
bindsym $mod+h focus left
bindsym $mod+j focus down
bindsym $mod+k focus up
bindsym $mod+l focus right
```

Move focused window (vim bindings):

```cfg
bindsym $mod+Shift+h move left
bindsym $mod+Shift+j move down
bindsym $mod+Shift+k move up
bindsym $mod+Shift+l move right
```

Split in horizontal and vertical orientations. When pressing a hint is displayed
on the window where the next application will be positioned.

```cfg
bindsym $mod+b split h
bindsym $mod+v split v
```

Toggle fullscreen mode for focused window:

```cfg
bindsym $mod+f fullscreen toggle
```

Change container layout (stacked, tabbed, toggle split):

```cfg
bindsym $mod+s layout stacking
bindsym $mod+w layout tabbed
bindsym $mod+e layout toggle split
```

Toggle tiling/floating:

```cfg
bindsym $mod+Shift+space floating toggle
```

Change fofuc between tiling/floating windows

```cfg
bindsym $mod+space focus mode_toggle
```

Focus the parent/child container:

```cfg
bindsym $mod+a focus parent
bindsym $mod+Shift+a focus child
```

Reload configuration file:

```cfg
bindsym $mod+Shift+r reload
```

Exit sway. Log out of wayland session:

```cfg
bindsym $mod+Shift+e exec "swaynag -t warning -m 'You pressed the exit shortcut. Do you really want to exit sway? This will end your wayland session.' -B 'Yes, exit sway' 'swaymsg exit'"
```


## Workspaces and window associations {#workspaces-and-window-associations}

Define names for default workspaces for which we configure key bindings later on. We use variables to avoid repeating the names in multiple places.

```cfg
set $ws1 "1:editor"
set $ws2 "2:browser"
set $ws3 "3:message"
set $ws4 "4:files"
Set $ws5 "5:"
set $ws6 "6"
set $ws7 "7"
set $ws8 "8"
set $ws9 "9"
set $ws10 "10:music"
```

Switch to workspace:

```cfg
bindsym $mod+1 workspace $ws1
bindsym $mod+2 workspace $ws2
bindsym $mod+3 workspace $ws3
bindsym $mod+4 workspace $ws4
bindsym $mod+5 workspace $ws5
bindsym $mod+6 workspace $ws6
bindsym $mod+7 workspace $ws7
bindsym $mod+8 workspace $ws8
bindsym $mod+9 workspace $ws9
bindsym $mod+0 workspace $ws10
```

Move workspace to left/right output:

```cfg
bindsym $mod+Shift+Alt+h move workspace to output left
bindsym $mod+Shift+Alt+l move workspace to output right
```

You can map workspace to output using this. Can be handy in multi-display
setups.

```cfg
workspace "1:editor" output DP1 eDP1
workspace "2:browser" output DP1 eDP1
```

Assign application window classes to workspaces:

```cfg
assign [class="Viber"] "3:message"
assign [class="Skype"] "3:message"
assign [class="Audacious"] "10:music"
```

_TODO: Write how to get the name of the application class._

Send curent workspace to other output:

```cfg
bindsym $mod+o exec swaymsg -t get_outputs | \
        jq '.[] | select(.focused!=true) | .name' | head -n1 | xargs swaymsg move workspace to
```

[Source](https://github.com/swaywm/sway/issues/4346)

Move focused container to workspace:

```nil
bindsym $mod+Shift+1 move container to workspace $ws1
bindsym $mod+Shift+2 move container to workspace $ws2
bindsym $mod+Shift+3 move container to workspace $ws3
bindsym $mod+Shift+4 move container to workspace $ws4
bindsym $mod+Shift+5 move container to workspace $ws5
bindsym $mod+Shift+6 move container to workspace $ws6
bindsym $mod+Shift+7 move container to workspace $ws7
bindsym $mod+Shift+8 move container to workspace $ws8
bindsym $mod+Shift+9 move container to workspace $ws9
bindsym $mod+Shift+0 move container to workspace $ws10
```


## Media buttons with bar overlay {#media-buttons}

Install [wob](https://github.com/francma/wob):

```sh
sudo pacman -S wob
```

Setup named pipe/socket (do this once):

```sh
mkfifo ~/.local/share/sway-wob.sock
```

Connect socket to wob in the config:

```cfg
exec tail -f $SWAYSOCK.wob | wob
```


### Screen brightness {#screen-brightness}

Install [light](https://github.com/haikarainen/light):

```sh
sudo pacman -S light
```

Call light on brightness keys and pipe to wob:

```cfg
bindsym XF86MonBrightnessUp exec light -A 10 && light -G | cut -d'.' -f1 > $SWAYSOCK.wob
bindsym XF86MonBrightnessDown exec light -U 10 && light -G | cut -d'.' -f1 > $SWAYSOCK.wob
```


### Media player controls {#media-player-controls}

Install [playerctl](https://github.com/altdesktop/playerctl):

```sh
sudo pacman -S playerctl
```

Call playerctl on media keys:

```cfg
bindsym XF86AudioPlay exec playerctl play-pause
bindsym XF86AudioStop exec playerctl stop
bindsym XF86AudioNext exec playerctl next
bindsym XF86AudioPrev exec playerctl previous
```
