content/recipes/sway-config.md


### Sound volume {#sound-volume}

Install [pamixer](https://github.com/cdemoulins/pamixer):

```sh
sudo pacman -S pamixer
```

Call pamixer on volume keys and pipe to wob:

```cfg
bindsym XF86AudioRaiseVolume exec pamixer -ui 5 && pamixer --get-volume > $SWAYSOCK.wob
bindsym XF86AudioLowerVolume exec pamixer -ud 5 && pamixer --get-volume > $SWAYSOCK.wob
bindsym XF86AudioMute exec pamixer --toggle-mute
```


## Window resizing {#window-resizing}

```cfg
# resize window (you can also use the mouse for that)
mode "resize" {
        # These bindings trigger as soon as you enter the resize mode
        bindsym {
          h resize shrink width 10 px or 10 ppt
          j resize grow height 10 px or 10 ppt
          k resize shrink height 10 px or 10 ppt
          l resize grow width 10 px or 10 ppt

          # back to normal: Enter or Escape or $mod+r
          Return mode "default"
          Escape mode "default"
          $mod+r mode "default"
        }
}
bindsym $mod+r mode "resize"
```


## System mode {#system-mode}

```cfg
set $mode_system System (l) lock, (e) logout, (s) suspend, (r) reboot, (Shift+s) shutdown
mode "$mode_system" {
    bindsym l exec $exit lock; mode "default"
    bindsym e exec $exit logout
    bindsym s exec $exit suspend; mode "default"
    bindsym r exec systemctl reboot
    bindsym Shift+s exec systemctl shutdown

    # back to normal: Enter or Escape
    bindsym Return mode "default"
    bindsym Escape mode "default"
}
bindsym $mod+End mode "$mode_system"
```

Exit script which locks and unmounts encFS mounts on suspend.

```sh
lock() {
    swaylock -c 003300
}

case "$1" in
    lock)
        lock
        ;;
    logout)
        swaymsg 'exit'
        ;;
    suspend)
        lock && encfs -u ~/Consulting && encfs -u ~/.ssh && ssh-add -D && systemctl suspend
        ;;
    *)
        echo "Usage: $0 {lock|logout|suspend}"
        exit 2
esac

exit 0
```


## Display mode {#display-profile}

Screen modes by location.

**Note:** mirroring is not [yet properly supported by sway](https://github.com/swaywm/sway/issues/1666) but there is [wl-mirror](https://github.com/Ferdi265/wl-mirror) as
a workaround. See also [this](https://bbs.archlinux.org/viewtopic.php?id=245038).

```cfg
set $mode_display LOCATION: (l)aptop (h)ome (m)eeting (d)ual dual-(r)ight (p)res-low
mode "$mode_display" {
     bindsym {
             l exec $display_profile laptop, mode "default"
             h exec $display_profile home, mode "default"
             d exec $display_profile dual, mode "default"
             r exec $display_profile dual-right, mode "default"
             m exec $display_profile meeting, mode "default"
             p exec $display_profile pres-lowres, mode "default"

             # back to normal: Enter or Escape
             Return mode "default"
             Escape mode "default"
     }
}
bindsym $mod+x mode "$mode_display"
```

Mirroring of output can be done with:

```sh
wl-mirror eDP-1
```

To mirror only a part of the output combine with slurp:

```sh
wl-mirror -r "$(slurp)"
```


### `display-profile` script {#display-profile-script}

```sh
# Set display profiles for various locations.
# WARNING! This script is maintained through Org Mode file. Do not edit directly.

LOCATION=$1
LAPTOP_OUTPUT=eDP-1
LAPTOP_MODE=`swaymsg -t get_outputs | jq ".[] | select(.name==\"$LAPTOP_OUTPUT\") | .modes[-1]"`
LAPTOP_RES=`echo $LAPTOP_MODE | jq ".width"`x`echo $LAPTOP_MODE | jq ".height"`
LAPTOP_WIDTH=`echo $LAPTOP_MODE | jq ".width"`

# Get auxiliary output
AUX_OUTPUT_JSON=`swaymsg -t get_outputs | jq ".[] | select(.name!=\"$LAPTOP_OUTPUT\")"`
AUX_MODE=`echo $AUX_OUTPUT_JSON | jq ".modes[0]"`
AUX_OUTPUT=`echo $AUX_OUTPUT_JSON | jq ".name"`
AUX_RES=`echo $AUX_MODE | jq ".width"`x`echo $AUX_MODE | jq ".height"`
AUX_WIDTH=`echo $AUX_MODE | jq ".width"`

echo $LAPTOP_OUTPUT
echo $LAPTOP_RES
echo $LAPTOP_WIDTH
echo $AUX_RES
echo $AUX_OUTPUT
echo $AUX_RES

move_workspaces_to_output(){
    OUTPUT=$1
    for i in {1..10}
    do
        swaymsg "[workspace=$i]" move workspace to output $OUTPUT
    done
}

case "$LOCATION" in
    "laptop")
        swaymsg output $LAPTOP_OUTPUT enable pos 0 0 res $LAPTOP_RES
        swaymsg output $AUX_OUTPUT disable
    ;;

    "home")
        swaymsg output $AUX_OUTPUT enable pos 0 0 res $AUX_RES, \
                output $LAPTOP_OUTPUT disable
    ;;

    "dual")
        swaymsg output $AUX_OUTPUT enable pos 0 0 res $AUX_RES scale 1, \
                output $LAPTOP_OUTPUT enable pos $AUX_WIDTH 0
        move_workspaces_to_output $LAPTOP_OUTPUT
    ;;

    "dual-right")
        swaymsg output $AUX_OUTPUT enable pos $AUX_WIDTH 0 res $AUX_RES scale 1, \
                output $LAPTOP_OUTPUT enable pos 0 0
        move_workspaces_to_output $LAPTOP_OUTPUT

    ;;

    "meeting")
        swaymsg output $AUX_OUTPUT enable pos $AUX_WIDTH 0 res $AUX_RES scale 1.5, \
                output $LAPTOP_OUTPUT enable pos 0 0
        move_workspaces_to_output $LAPTOP_OUTPUT
    ;;

    "pres-lowres")
        swaymsg output $AUX_OUTPUT enable pos $LAPTOP_WIDTH 0 res 1280x1024, \
                output $LAPTOP_OUTPUT enable
        move_workspaces_to_output $LAPTOP_OUTPUT
    ;;

esac
```
