content/recipes/sway-config.md


## waybar {#waybar}

Config sway to use waybar.

```cfg
bar {
       swaybar_command waybar
}
```

Install font `Hack Nerd` used for swaync notification icons.

```sh
sudo pacman -S ttf-hack-nerd
```

Waybar configuration:

```cfg
{
    "layer": "top",
    "position": "bottom",

    "modules-left": [
        "sway/workspaces",
        "custom/right-arrow-dark",
    "sway/mode"
    ],
    //"modules-center": [
        // "custom/left-arrow-dark",
        // "custom/weather",
        //"custom/left-arrow-light",
        //"custom/left-arrow-dark",
        //"clock#1",
        //"custom/left-arrow-light",
        //"custom/left-arrow-dark",
        //"clock#2",
        //"custom/right-arrow-dark"
        // "custom/right-arrow-light",
        //"clock#3",
        //"custom/right-arrow-dark",

    //],
    "modules-right": [
        "custom/left-arrow-dark",
        "network",
        "custom/left-arrow-light",
        "custom/left-arrow-dark",
        "memory",
        "custom/left-arrow-light",
        "custom/left-arrow-dark",
        "cpu",
        "custom/left-arrow-light",
        "custom/left-arrow-dark",
        "battery",
        "custom/left-arrow-light",
        "custom/left-arrow-dark",
        "pulseaudio",
        "custom/left-arrow-light",
        "custom/left-arrow-dark",
//      "idle_inhibitor",
        "custom/notification",
        "custom/left-arrow-light",
        "custom/left-arrow-dark",
        "sway/language",
        "custom/left-arrow-light",
        "custom/left-arrow-dark",
        "tray",
        "custom/weather",
        "custom/left-arrow-light",
        "custom/left-arrow-dark",
        "clock#2",
        "custom/right-arrow-dark"
    ],

    "custom/left-arrow-dark": {
        "format": "",
        "tooltip": false
    },
    "custom/left-arrow-light": {
        "format": "",
        "tooltip": false
    },
    "custom/right-arrow-dark": {
        "format": "",
        "tooltip": false
    },
    "custom/right-arrow-light": {
        "format": "",
        "tooltip": false
    },

    "sway/workspaces": {
        "disable-scroll": true,
        "format": "{name}"
    },

    "clock#1": {
        "format": "{:%a}",
        "tooltip": false
    },
    "clock#2": {
        "format": "{:%H:%M}",
        "tooltip": false
    },
    "clock#3": {
        "format": "{:%d-%m}",
        "tooltip": false
    },
    "custom/weather": {
        "exec": "curl 'https://wttr.in/?format=1' -s | cut -c 1-6,9-15",
        "interval": 3600
    },
    "sway/language": {
        "format": "{}",
        "max-length": 5,
        "min-length": 5,
    },
    "pulseaudio": {
        "format": "{icon} {volume:2}%",
        "format-bluetooth": "{icon}  {volume}%",
        "format-muted": "MUTE",
        "format-icons": {
            "headphones": "",
            "default": [
                "",
                ""
            ]
        },
        "scroll-step": 5,
        "on-click": "pamixer -t",
        "on-click-right": "pavucontrol"
    },
    "memory": {
        "interval": 5,
        "format": "Mem {}%"
    },
    "cpu": {
        "interval": 5,
        "format": "CPU {usage:2}%"
    },
    "battery": {
        "states": {
            "good": 95,
            "warning": 30,
            "critical": 15
        },
        "format": "{icon} {capacity}%",
        "format-icons": [
            "",
            "",
            "",
            "",
            ""
        ]
    },
  "network": {
      // "interface": "wlp2*", // (Optional) To force the use of this interface
      "interval": 3,
      "format-wifi": "{essid} ({signalStrength}%, {bandwidthDownBits}|{bandwidthUpBits}) ",
      "format-ethernet": "{ifname}: {ipaddr}/{cidr} ({bandwidthDownBits}|{bandwidthUpBits}) ",
      "format-linked": "{ifname} (No IP) ",
      "format-disconnected": "Disconnected ⚠",
      "format-alt": "{ifname}: {ipaddr}/{cidr}"
  },
  "idle_inhibitor": {
          "format": "{icon}",
          "format-icons": {
              "activated": "",
              "deactivated": ""
          }
  },
  "custom/notification": {
          "tooltip": false,
          "format": "{icon}",
          "format-icons": {
                  "notification": "<span foreground='red'><sup></sup></span>",
                  "none": "",
                  "dnd-notification": "<span foreground='red'><sup></sup></span>",
                  "dnd-none": ""
          },
          "return-type": "json",
          "exec-if": "which swaync-client",
          "exec": "swaync-client -swb",
          "on-click": "swaync-client -t -sw",
          "on-click-right": "swaync-client -d -sw",
          "escape": true
        },

   "tray": {
        "icon-size": 20
   }
}
```


### css {#css}

```css
** {
    font-size: 15px;
    font-family: monospace;
}

window#waybar {
    background: #292b2e;
    color: #fdf6e3;
}

#custom-right-arrow-dark,
#custom-left-arrow-dark {
    color: #1a1a1a;
}
#custom-right-arrow-light,
#custom-left-arrow-light {
    color: #292b2e;
    background: #1a1a1a;
}

#workspaces,
#clock.1,
#clock.2,
#clock.3,
#custom-weather,
#custom-notification,
#language,
#pulseaudio,
#backlight,
#memory,
#cpu,
#temperature,
#network,
#battery,
#tray {
    background: #1a1a1a;
}

#workspaces button {
    padding: 0 2px;
    color: #fdf6e3;
}
#workspaces button.focused {
    color: #268bd2;
}
#workspaces button.urgent {
      background: #aa0000;
}
#workspaces button:hover {
    box-shadow: inherit;
    text-shadow: inherit;
}
#workspaces button:hover {
    background: #1a1a1a;
    border: #1a1a1a;
    padding: 0 3px;
}

#mode {
      background: #aa0000;
}

#pulseaudio {
    color: #268bd2;
}
#backlight {
    color: #b58900;
}
#memory {
    color: #2aa198;
}
#temperature {
    color: #b58900;
}
#cpu {
    color: #6c71c4;
}
#battery {
    color: #859900;
}
#battery.discharging {
      color: #dd9900;
}
#network {
  color: #8599aa;
}
#custom-notification {
  font-family: "NotoSansMono Nerd Font";
}

#mode,
#clock,
#pulseaudio,
#backlight,
#memory,
#cpu,
#custom-notification,
#custom-weather,
#temperature,
#battery {
    padding: 0 10px;
}
```


## Application launcher, window switcher {#application-launcher-window-switcher}

[Rofi](https://github.com/davatorium/rofi) is a popular application launcher and window switcher. See also [ArchLinux
wiki page](https://wiki.archlinux.org/title/Rofi).

Currently original rofi has no support for wayland. There is a fork with wayland
support. Install with:

```sh
yay -S --mflags "--nocheck" rofi-lbonn-wayland
```

`--nocheck` is needed at the moment as there is [a problem with libnkutils](https://github.com/lbonn/rofi/issues/63). If you
are reading this in a fairly distant future probably you won't need this.

Keyboard shortcut.

```cfg
bindsym $mod+d exec rofi -modes combi -show combi -combi-modes run,drun
```


### Rofi configuration {#rofi-configuration}

```cfg
@theme "/usr/share/rofi/themes/Arc-Dark.rasi"
configuration {
    modi: "window,run,ssh";
    timeout {
        action: "kb-cancel";
        delay:  0;
    }
    filebrowser {
        directories-first: true;
        sorting-method:    "name";
    }
}
```


## Clipboard {#clipboard}

[wl-clipboard](https://github.com/bugaevc/wl-clipboard) is a command line tool for copy/pasting text.

```sh
sudo pacman -S wl-clipboard
```

Now, text can be copied from CLI with `<some command> | wl-copy` or pasted from
clipboard with `wl-paste | <some command>`.

A clipboard is emptied when window is closed by default. To persist clipboard
after window closing use clipboard manager like [clipman](https://github.com/yory8/clipman).

```sh
sudo pacman -S clipman
```

Start with sway:

```cfg
exec wl-paste -t text --watch clipman store --no-persist
```


## Touch pad {#touch-pad}

Enable tap and natural scroll.

```cfg
input type:touchpad {
    tap enabled
    natural_scroll enabled
}
```
