site.org
*** Keyboards layouts
#+begin_src conf
input * {
  xkb_layout "us,rs,rs"
  xkb_variant ",latin,"
  xkb_options "grp:shifts_toggle"
}

#+end_src
*** Red shift
Install [[https://gitlab.com/chinstrap/gammastep][gammastep]]
#+begin_src sh
sudo pacman -S gammastep
#+end_src

Execute it from sway config with your long/lat:
#+begin_src conf
exec_always gammastep -l 45.26:19.83
#+end_src

There is also a tray indicator ~gammastep-indicator~. I'm not using it.

*** NetworkManager
Run applet with ~--indictator~ switch:
#+begin_src conf
exec_always nm-applet --indicator
#+end_src
*** TODO Bluetooth
Not working with sway. Will investigate.
#+begin_src conf :tangle no
exec blueman-applet
#+end_src

*** Wacom tablet
I use Wacom CTL-471 for screen annotation during lectures. [[https://github.com/OpenTabletDriver/OpenTabletDriver][OpenTabletDriver]] is a
user-mode cross-platform tablet driver with settings GUI.

Blacklist wacom kernel module:
#+begin_src sh
sudo sh -c "echo 'blacklist wacom' > /etc/modprobe.d/nowacom.conf"
#+end_src

#+begin_src sh
yay -S opentabletdriver
#+end_src

Start OTD from sway:
#+begin_src conf
exec otd
#+end_src

Run =otd-gui= for configuration.

Using [[https://github.com/bk138/gromit-mpx/][gromit-mpx]] for screen annotation.

There is a problem with capturing hotkeys. A workaround is to [[https://github.com/bk138/gromit-mpx/issues/127#issuecomment-1211957811][handle hotkeys
through sway]].

#+begin_src conf
mode "gromit-mpx" {
    # toggle painting
    bindsym f9 exec gromit-mpx --toggle
    # clear
    bindsym Shift+f9 exec gromit-mpx --clear
    # toggle visibility
    bindsym Ctrl+f9 exec gromit-mpx --visibility
    # quit
    bindsym Alt+f9 exec gromit-mpx --quit
    # undo
    bindsym f8 exec gromit-mpx --undo
    # redo
    bindsym Shift+f8 exec gromit-mpx --redo

    # Return to default mode
    bindsym $mod+g mode "default"
}
bindsym $mod+g mode "gromit-mpx"
#+end_src


Gromit-MPX use Xwayland. So to find the name of the device use:
#+begin_src sh
xinput --list
#+end_src

Gromit-MPX config with red and green pen and eraser:
#+begin_src conf :tangle "~/.config/gromit-mpx.cfg"
"red Pen" = PEN (size=7 color="red");
"green Pen" = "red Pen" (color="green");

"Eraser" = ERASER (size = 75);

"Virtual core pointer" = "red Pen";
"Virtual core pointer"[Button2] = "green Pen";
"Virtual core pointer"[Button3] = "Eraser";
#+end_src

#+begin_src ini :tangle "~/.config/gromit-mpx.ini"
[General]
ShowIntroOnStartup=false

[Drawing]
Opacity=0.75
#+end_src

*** Notification daemon
Using swaync.
#+begin_src sh
sudo yay -S swaync
#+end_src

Start with sway.
#+begin_src conf
exec_always swaync
#+end_src

Show pannel.
#+begin_src conf
bindsym $mod+grave exec swaync-client -t
#+end_src

Toggle Do-Not-Disturb mode.
#+begin_src conf
bindsym $mod+p exec swaync-client -d
#+end_src

Close all notifications:
#+begin_src conf
bindsym $mod+c exec swaync-client -C
#+end_src

See also the waybar configuration above.
*** Warning on battery critical level
Check battery, notify when low and suspend when critical.
Taken and adapted from [[https://wiki.archlinux.org/index.php/Laptop#Hibernate_on_low_battery_level][ArchLinux wiki]].

#+begin_src sh :tangle "~/.config/sway/check_battery.sh" :shebang "#!/bin/sh"
acpi -b | awk -F'[,:%]' '{print $2, $3}' | {
    read -r status capacity

    if [ "$status" = Discharging ]; then
           if [ "$capacity" -lt 5 ]; then
               systemctl suspend
           elif [ "$capacity" -lt 15 ]; then
               notify-send -u critical "Battery low" "Current capacity is (${capacity}%)."
           fi
    fi
}
#+end_src

Create crontab entry with command =crontab -e= which call check script at 5 minute
interval.
#+begin_src cron
*/5  * * * *  XDG_RUNTIME_DIR=/run/user/$(id -u) $HOME/.config/sway/check_battery.sh
#+end_src

*** Autostart apps
#+begin_src conf
exec {
  swaymsg 'workspace 1:editor; exec emacs'
  swaymsg 'workspace 2:browser; exec firefox'
}
#+end_src

