content/recipes/sway-config.md


## Keyboards layouts {#keyboards-layouts}

```cfg
input * {
  xkb_layout "us,rs,rs"
  xkb_variant ",latin,"
  xkb_options "grp:shifts_toggle"
}
```


## Red shift {#red-shift}

Install [gammastep](https://gitlab.com/chinstrap/gammastep)

```sh
sudo pacman -S gammastep
```

Execute it from sway config with your long/lat:

```cfg
exec_always gammastep -l 45.26:19.83
```

There is also a tray indicator `gammastep-indicator`. I'm not using it.


## NetworkManager {#networkmanager}

Run applet with `--indictator` switch:

```cfg
exec_always nm-applet --indicator
```


## <span class="org-todo todo TODO">TODO</span> Bluetooth {#bluetooth}

Not working with sway. Will investigate.

```cfg
exec blueman-applet
```


## Wacom tablet {#wacom-tablet}

I use Wacom CTL-471 for screen annotation during lectures. [OpenTabletDriver](https://github.com/OpenTabletDriver/OpenTabletDriver) is a
user-mode cross-platform tablet driver with settings GUI.

Blacklist wacom kernel module:

```sh
sudo sh -c "echo 'blacklist wacom' > /etc/modprobe.d/nowacom.conf"
```

```sh
yay -S opentabletdriver
```

Start OTD from sway:

```cfg
exec otd
```

Run `otd-gui` for configuration.

Using [gromit-mpx](https://github.com/bk138/gromit-mpx/) for screen annotation.

There is a problem with capturing hotkeys. A workaround is to [handle hotkeys
through sway](https://github.com/bk138/gromit-mpx/issues/127#issuecomment-1211957811).

```cfg
mode "gromit-mpx" {
    # toggle painting
    bindsym f9 exec gromit-mpx --toggle
    # clear
    bindsym Shift+f9 exec gromit-mpx --clear
    # toggle visibility
    bindsym Ctrl+f9 exec gromit-mpx --visibility
    # quit
    bindsym Alt+f9 exec gromit-mpx --quit
    # undo
    bindsym f8 exec gromit-mpx --undo
    # redo
    bindsym Shift+f8 exec gromit-mpx --redo

    # Return to default mode
    bindsym $mod+g mode "default"
}
bindsym $mod+g mode "gromit-mpx"
```

Gromit-MPX use Xwayland. So to find the name of the device use:

```sh
xinput --list
```

Gromit-MPX config with red and green pen and eraser:

```cfg
"red Pen" = PEN (size=7 color="red");
"green Pen" = "red Pen" (color="green");

"Eraser" = ERASER (size = 75);

"Virtual core pointer" = "red Pen";
"Virtual core pointer"[Button2] = "green Pen";
"Virtual core pointer"[Button3] = "Eraser";
```

```ini
[General]
ShowIntroOnStartup=false

[Drawing]
Opacity=0.75
```


## Notification daemon {#notification-daemon}

Using swaync.

```sh
sudo yay -S swaync
```

Start with sway.

```cfg
exec_always swaync
```

Show pannel.

```cfg
bindsym $mod+grave exec swaync-client -t
```

Toggle Do-Not-Disturb mode.

```cfg
bindsym $mod+p exec swaync-client -d
```

Close all notifications:

```cfg
bindsym $mod+c exec swaync-client -C
```

See also the waybar configuration above.


## Warning on battery critical level {#warning-on-battery-critical-level}

Check battery, notify when low and suspend when critical.
Taken and adapted from [ArchLinux wiki](https://wiki.archlinux.org/index.php/Laptop#Hibernate_on_low_battery_level).

```sh
acpi -b | awk -F'[,:%]' '{print $2, $3}' | {
    read -r status capacity

    if [ "$status" = Discharging ]; then
           if [ "$capacity" -lt 5 ]; then
               systemctl suspend
           elif [ "$capacity" -lt 15 ]; then
               notify-send -u critical "Battery low" "Current capacity is (${capacity}%)."
           fi
    fi
}
```

Create crontab entry with command `crontab -e` which call check script at 5 minute
interval.

```cron
*/5  * * * *  XDG_RUNTIME_DIR=/run/user/$(id -u) $HOME/.config/sway/check_battery.sh
```


## Autostart apps {#autostart-apps}

```cfg
exec {
  swaymsg 'workspace 1:editor; exec emacs'
  swaymsg 'workspace 2:browser; exec firefox'
}
```
